In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
transcript = pd.read_csv('transcript.csv',index_col=0)
transcript = transcript.rename(columns={'person': 'id'})
transcript.head()

,id,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

In [10]:
transcript['event'].unique()

array(['offer received', 'offer viewed', 'transaction', 'offer completed'],
      dtype=object)

In [3]:
transcript.shape

(306534, 4)

In [13]:
transcript=transcript[transcript['event']=='offer completed']

In [14]:
transcript.shape

(33579, 4)

In [15]:
profile = pd.read_csv('profile.csv', index_col = 0)
profile.head()

  gender  age                                id  became_member_on    income
0    NaN  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2    NaN  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4    NaN  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

In [16]:
profile.shape

(17000, 5)

In [17]:
df = transcript.merge(profile, on = 'id',  how='inner')
df.head()

,id,event,value,time,gender,age,became_member_on,income
0,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '2906b810c7d4411798c6938adc9daaa5...,0,M,42,20160117,96000.0
1,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...,354,M,42,20160117,96000.0
2,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '0b1e1539f2cc45b7b9fa7c272da2e1d7...,474,M,42,20160117,96000.0
3,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0...,540,M,42,20160117,96000.0
4,fe97aa22dd3e48c8b143116a8403dd52,offer completed,{'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...,0,F,39,20171217,67000.0

In [18]:
df.shape

(33579, 8)

In [19]:
df.isnull().sum()

id                     0
event                  0
value                  0
time                   0
gender              1135
age                    0
became_member_on       0
income              1135
dtype: int64

In [31]:
df.head(20)

,id,event,value,time,gender,age,became_member_on,income
0,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '2906b810c7d4411798c6938adc9daaa5...,0,M,42,20160117,96000.0
1,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...,354,M,42,20160117,96000.0
2,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '0b1e1539f2cc45b7b9fa7c272da2e1d7...,474,M,42,20160117,96000.0
3,9fa9ae8f57894cc9a3b8a9bbe0fc1b2f,offer completed,{'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0...,540,M,42,20160117,96000.0
4,fe97aa22dd3e48c8b143116a8403dd52,offer completed,{'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...,0,F,39,20171217,67000.0
5,629fc02d56414d91bca360decdfa9288,offer completed,{'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...,0,M,52,20180605,72000.0
6,629fc02d56414d91bca360decdfa9288,offer completed,{'offer_id': '2906b810c7d4411798c6938adc9daaa5...,432,M,52,20180605,72000.0
7,629fc02d56414d91bca360decdfa9288,offer completed,{'offer_id': '0b1e1539f2cc45b7b9fa7c272da2e1d7...,666,M,52,20180605,72000.0
8,676506bad68e4161b9bbaffeb039626b,offer completed,{'offer_id': 'ae264e3637204a6fb9bb56bc8210ddfd...,0,M,37,20170515,92000.0
9,676506bad68e4161b9bbaffeb039626b,offer completed,{'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...,636,M,37,20170515,92000.0
10,8f7dd3b2afe14c078eb4f6e6fe4ba97d,offer completed,{'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0...,0,M,48,20150903,62000.0
11,227f2d69e46a4899b70d48182822cff6,offer completed,{'offer_id': '4d5c57ea9a6940dd891ad53e9dbe8da0...,0,M,51,20180512,100000.0
12,227f2d69e46a4899b70d48182822cff6,offer completed,{'offer_id': 'ae264e3637204a6fb9bb56bc8210ddfd...,642,M,51,20180512,100000.0
13,bb0f25e23a4c4de6a645527c275cd594,offer completed,{'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...,0,M,56,20140611,76000.0
14,bb0f25e23a4c4de6a645527c275cd594,offer completed,{'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...,264,M,56,20140611,76000.0
15,bb0f25e23a4c4de6a645527c275cd594,offer completed,{'offer_id': '0b1e1539f2cc45b7b9fa7c272da2e1d7...,450,M,56,20140611,76000.0
16,bb0f25e23a4c4de6a645527c275cd594,offer completed,{'offer_id': 'ae264e3637204a6fb9bb56bc8210ddfd...,540,M,56,20140611,76000.0
17,bb0f25e23a4c4de6a645527c275cd594,offer completed,{'offer_id': '2298d6c36e964ae4a3e7e9706d1fb8c2...,654,M,56,20140611,76000.0
18,d72d201be5794279aa716d8ad82b8d90,offer completed,{'offer_id': 'f19421c1d4aa40978ebb69ca19b0e20d...,0,F,51,20160223,73000.0
19,d72d201be5794279aa716d8ad82b8d90,offer completed,{'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...,342,F,51,20160223,73000.0

In [29]:
len(df.id.unique())

11986

In [30]:
len(df.value.unique())

8

In [21]:
df.dropna(inplace=True)

In [22]:
df.isnull().sum()

id                  0
event               0
value               0
time                0
gender              0
age                 0
became_member_on    0
income              0
dtype: int64

In [23]:
df.shape

(32444, 8)

In [36]:
newdf=df.groupby('id')[['event','value']].count()

In [48]:
newdf=newdf.reset_index()

In [72]:
lst=df.columns[4:]

In [83]:
for col in lst:
    dic={}
    for i in newdf['id']:
        if i not in dic:
            dic[i]=df[df['id']==i][col].iloc[0]
    newdf[col]=newdf['id'].map(dic)

In [84]:
newdf.head(5)

,id,event,value,gender,age,became_member_on,income
0,0009655768c64bdeb2e877511632db8f,3,3,M,33,20170421,72000.0
1,0011e0d4e6b944f998e987f904e8c1e5,3,3,O,40,20180109,57000.0
2,0020c2b971eb4e9188eac86d93036a77,3,3,F,59,20160304,90000.0
3,0020ccbbb6d84e358d3414a3ff76cffd,3,3,F,24,20161111,60000.0
4,003d66b6608740288d6cc97a6903f4f0,3,3,F,26,20170621,73000.0